<a href="https://colab.research.google.com/github/dudaspm/IST210-Spring2020/blob/master/SQL/ForChapterAssessment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import sqlite3 # Once imported in a single notebook, it is available to us throughout the rest of the notebook. 
# connect to database, if not there, create it.
connectionToDatabase = sqlite3.connect('StudentFinancial') 
cursor = connectionToDatabase.cursor()
cursor.execute('''drop table IF EXISTS student''')
connectionToDatabase.commit()

cursor.execute('''create table student (PSUID text PRIMARY KEY, firstname text, lastname text, email text, department text)''')
connectionToDatabase.commit()

cursor.execute('''drop table IF EXISTS tuition''')
connectionToDatabase.commit()

cursor.execute('''create table tuition (tuitionID text PRIMARY KEY, student text, semesterCost int, scholarship int, dueDate text)''')
connectionToDatabase.commit()

In [1]:
%load_ext sql
%sql sqlite:///StudentFinancial.db

'Connected: @StudentFinancial.db'

In [2]:
%%sql  
DROP TABLE IF EXISTS student;
create table student (PSUID text PRIMARY KEY, firstname text, lastname text, email text, department text);

DROP TABLE IF EXISTS tuition;
create table tuition (tuitionID text PRIMARY KEY, student text, semesterCost int, scholarship int, dueDate text);

 * sqlite:///StudentFinancial.db
Done.
Done.
Done.
Done.

[]

In [0]:
first = ["Charlotte","Brad","Kyle","Alexander","Susan","Olivia","Oscar","Isabella","Pranav","Jenay"]

In [0]:
last = ["Mcintyre","Mora","Ortiz","Morrison","Yu","Gilbert","Tate","Berger","Keller","Mann"]

In [0]:
department = ["College of IST","Physics","Math","Art"]

In [7]:
import random
ids = []
for i in range(len(first)):
  id = random.randint(9000000, 10000000)
  ids.append(id)
  f = first[i]
  l = last[i]
  e = f[0] + l[0] + l[1] + str(random.randint(0, 20))
  e = e.lower()
  d = department[random.randint(0, len(department)-1)]
  %sql insert into student values (:id,:f,:l,:e,:d)

 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.

In [0]:
DueDates = ["2020-09-30","2020-06-30","2021-01-30"]

In [10]:
for id in ids:
  tid = random.randint(100000, 200000)
  c = 10000
  s = random.randint(0, c)
  d = DueDates[random.randint(0, len(DueDates)-1)]
  t = """%s,%s,%s,%s,%s""" % (tid,id,c,s,d)
  %sql insert into tuition values (:tid,:id,:c,:s,:d)

 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.
 * sqlite:///StudentFinancial.db
1 rows affected.

In [11]:
%%sql
select * from student;

 * sqlite:///StudentFinancial.db
Done.

[('9410479', 'Charlotte', 'Mcintyre', 'cmc13', 'Physics'),
 ('9420351', 'Brad', 'Mora', 'bmo20', 'Art'),
 ('9244087', 'Kyle', 'Ortiz', 'kor3', 'Art'),
 ('9793968', 'Alexander', 'Morrison', 'amo19', 'Art'),
 ('9749341', 'Susan', 'Yu', 'syu4', 'College of IST'),
 ('9316499', 'Olivia', 'Gilbert', 'ogi19', 'Math'),
 ('9211309', 'Oscar', 'Tate', 'ota16', 'College of IST'),
 ('9030081', 'Isabella', 'Berger', 'ibe13', 'Math'),
 ('9120732', 'Pranav', 'Keller', 'pke4', 'Physics'),
 ('9134982', 'Jenay', 'Mann', 'jma14', 'College of IST')]

In [12]:
%%sql
select * from tuition;

 * sqlite:///StudentFinancial.db
Done.

[('118598', '9410479', 10000, 7212, '2020-06-30'),
 ('103184', '9420351', 10000, 9822, '2020-09-30'),
 ('145304', '9244087', 10000, 7502, '2021-01-30'),
 ('112972', '9793968', 10000, 1803, '2021-01-30'),
 ('125873', '9749341', 10000, 3024, '2021-01-30'),
 ('112807', '9316499', 10000, 738, '2020-09-30'),
 ('160684', '9211309', 10000, 9862, '2020-09-30'),
 ('126735', '9030081', 10000, 8876, '2020-06-30'),
 ('192180', '9120732', 10000, 9138, '2021-01-30'),
 ('151975', '9134982', 10000, 7056, '2020-09-30')]

In [0]:
|